/*************************
 * Автор: Никита Захаров *
 * Вариант: 6            *
 * ***********************/
 
#include <iostream>
#include <cmath>

using namespace std;

int main() {
  
  double F; //Динамическая удерживающая способность насадочной химической колонны
  double Ga; //Число Галилея
  double v = 0.01; //Вязкость жидкости
  double d;
  double Re; //Число Рейнольдса
  double g = 9.8; //Ускорение силы тяжести
  
  cout << "Введите значение эквивалентного диаметра насадки: ";
  cin >> d;
  
  Re = 4.1 * pow(10.0, 4.0);
  
  cout << "F \tGa \n"; //Разбили будущие значения F и Ga на два столбика
  
  while (v < 0.09) {
    Ga = (g * pow(d, 3.0)) / v;
    
    if (Ga < (4.0 * pow(10.0, 4.0))) {
      F = 0.183 * pow(Re, 0.74) * pow(Ga, -0.256);
      cout << F << "\t" << Ga << endl;
    } else {
      F = 3.0 * pow(Re, 0.74) * pow(Ga, -0.52);
      cout << F << "\t" << Ga << endl;
    }
    
    //Шаг вязкости жидкости v: 0.04
    v = v + 0.04;
  }
  
  v = v + 0.01; //Приравниваем вязкость жидкости к значению, нужному для следующего цикла
  
  do {
    Ga = (g * pow(d, 3.0)) / v;
    
    if (Ga < 4.0 * pow(10.0, 4.0)) {
      F = 0.183 * pow(Re, 0.74) * pow(Ga, -0.256);
      cout << F << "\t" << Ga << endl;
    } else {
      F = 3.0 * pow(Re, 0.74) * pow(Ga, -0.52);
      cout << F << "\t" << Ga << endl;
    }
    
    //Шаг вязкости жидкости v: 0.4
    v = v + 0.4; } while (v < 0.51);
    
  v = v + 0.1; //Приравниваем вязкость жидкости к значению, нужному для следующего цикла
  
  while (v < 2.1) {
    Ga = (g * pow(d, 3.0)) / v;
    
    if (Ga < 4.0 * pow(10.0, 4.0)) {
      F = 0.183 * pow(Re, 0.74) * pow(Ga, -0.256);
      cout << F << "\t" << Ga << endl;
    } else {
      F = 3.0 * pow(Re, 0.74) * pow(Ga, -0.52);
      cout << F << "\t" << Ga << endl;
    }
    
    v = v + 1.0; //Шаг вязкости жидкости v: 1.0
  }
  
  return 0;
}